
Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
```python
a = int(input())
b = int(input())
if a < b:
    for i in range(a, b + 1):
        print(i, end=' ')
else:
    for i in range(a, b - 1, -1):
        print(i, end=' ')
```


Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.
```python
A = int(input())
B = int(input())
for number in range(A, B + 1):
    print(number)
```

За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров? Программа получает на вход числа n и m.
```python
n = int(input())
m = int(input())
import math
days = math.ceil(m / n)

print(days)
```
